<a href="https://colab.research.google.com/github/ssong915/Data-analysis/blob/main/pandas_practice.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive

In [2]:
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
!pip install konlpy

Collecting konlpy
  Downloading konlpy-0.5.2-py2.py3-none-any.whl (19.4 MB)
     |████████████████████████████████| 19.4 MB 1.2 MB/s
Collecting colorama
  Downloading colorama-0.4.4-py2.py3-none-any.whl (16 kB)
Collecting JPype1>=0.7.0
  Downloading JPype1-1.3.0-cp37-cp37m-manylinux_2_5_x86_64.manylinux1_x86_64.whl (448 kB)
     |████████████████████████████████| 448 kB 37.8 MB/s
Requirement already satisfied: tweepy>=3.7.0 in /usr/local/lib/python3.7/dist-packages (from konlpy) (3.10.0)
Requirement already satisfied: numpy>=1.6 in /usr/local/lib/python3.7/dist-packages (from konlpy) (1.19.5)
Requirement already satisfied: lxml>=4.1.0 in /usr/local/lib/python3.7/dist-packages (from konlpy) (4.2.6)
Collecting beautifulsoup4==4.6.0
  Downloading beautifulsoup4-4.6.0-py3-none-any.whl (86 kB)
     |████████████████████████████████| 86 kB 5.2 MB/s
Requirement already satisfied: typing-extensions in /usr/local/lib/python3.7/dist-packages (from JPype1>=0.7.0->konlpy) (3.7.4.3)
Requirement already satisfied: requests-oauthlib>=0.7.0 in /usr/local/lib/python3.7/dist-packages (from tweepy>=3.7.0->konlpy) (1.3.0)
Requirement already satisfied: requests[socks]>=2.11.1 in /usr/local/lib/python3.7/dist-packages (from tweepy>=3.7.0->konlpy) (2.23.0)
Requirement already satisfied: six>=1.10.0 in /usr/local/lib/python3.7/dist-packages (from tweepy>=3.7.0->konlpy) (1.15.0)
Requirement already satisfied: oauthlib>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from requests-oauthlib>=0.7.0->tweepy>=3.7.0->konlpy) (3.1.1)
Requirement already satisfied: idna<3,>=2.5 in /usr/local/lib/python3.7/dist-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (2.10)
Requirement already satisfied: chardet<4,>=3.0.2 in /usr/local/lib/python3.7/dist-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (3.0.4)
Requirement already satisfied: urllib3!=1.25.0,!=1.25.1,<1.26,>=1.21.1 in /usr/local/lib/python3.7/dist-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (1.24.3)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.7/dist-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (2021.5.30)
Requirement already satisfied: PySocks!=1.5.7,>=1.5.6 in /usr/local/lib/python3.7/dist-packages (from requests[socks]>=2.11.1->tweepy>=3.7.0->konlpy) (1.7.1)
Installing collected packages: JPype1, colorama, beautifulsoup4, konlpy
  Attempting uninstall: beautifulsoup4
    Found existing installation: beautifulsoup4 4.6.3
    Uninstalling beautifulsoup4-4.6.3:
      Successfully uninstalled beautifulsoup4-4.6.3
Successfully installed JPype1-1.3.0 beautifulsoup4-4.6.0 colorama-0.4.4 konlpy-0.5.2

In [4]:
import pandas as pd

In [5]:
skull = pd.read_csv('/content/drive/My Drive/news/skull.csv')

In [6]:
import numpy as np

In [10]:
a = np.array([[1,1,1],[2,2,2],[3,3,3]])
a

array([[1, 1, 1],
       [2, 2, 2],
       [3, 3, 3]])

In [12]:
b = np.array([1,2,3])
b

array([1, 2, 3])

In [14]:
np.sum(b), np.mean(b), np.std(b), np.max(b), np.min(b) #행렬 곱: np.matmul(a,b)

(6, 2.0, 0.816496580927726, 3, 1)

In [15]:
import pandas as pd

In [20]:
#Series
pd.Series([7,8,9], name = '고지형',index = [10,20,30])

In [19]:
pd.Series({'인':1,'덱':2,'스':[3,2,1]})

인            1
덱            2
스    [3, 2, 1]
dtype: object

In [21]:
#Data Frame : 행,열
ls = [5,6,7,8,9]
ls2 = [9,8,7,6,5]
pd.DataFrame([ls,ls2])

   0  1  2  3  4
0  5  6  7  8  9
1  9  8  7  6  5

In [23]:
pd.DataFrame([ls,ls2], columns = ['one','two','three','four','five'])

   one  two  three  four  five
0    5    6      7     8     9
1    9    8      7     6     5

In [25]:
Dic = {'Apple': [1,3,4,4,5,6,7,8,8],
       'Banana':[2,3,4,5,6,7,7,8,3],
       'Carrot':[1,6,4,2,8,4,5,8,9]}
fruits = pd.DataFrame(Dic)
fruits

   Apple  Banana  Carrot
0      1       2       1
1      3       3       6
2      4       4       4
3      4       5       2
4      5       6       8
5      6       7       4
6      7       7       5
7      8       8       8
8      8       3       9

In [27]:
fruits.head(10)

   Apple  Banana  Carrot
0      1       2       1
1      3       3       6
2      4       4       4
3      4       5       2
4      5       6       8
5      6       7       4
6      7       7       5
7      8       8       8
8      8       3       9

In [29]:
fruits.tail(5)

   Apple  Banana  Carrot
4      5       6       8
5      6       7       4
6      7       7       5
7      8       8       8
8      8       3       9

In [31]:
fruits.columns

Index(['Apple', 'Banana', 'Carrot'], dtype='object')

In [32]:
fruits.index

RangeIndex(start=0, stop=9, step=1)

In [33]:
fruits.describe()

          Apple   Banana    Carrot
count  9.000000  9.00000  9.000000
mean   5.111111  5.00000  5.222222
std    2.368778  2.12132  2.773886
min    1.000000  2.00000  1.000000
25%    4.000000  3.00000  4.000000
50%    5.000000  5.00000  5.000000
75%    7.000000  7.00000  8.000000
max    8.000000  8.00000  9.000000

In [34]:
fruits['Apple']

0    1
1    3
2    4
3    4
4    5
5    6
6    7
7    8
8    8
Name: Apple, dtype: int64

In [36]:
fruits['Donut']=[3*i +3 for i in range(9)]
fruits

   Apple  Banana  Carrot  Donut
0      1       2       1      3
1      3       3       6      6
2      4       4       4      9
3      4       5       2     12
4      5       6       8     15
5      6       7       4     18
6      7       7       5     21
7      8       8       8     24
8      8       3       9     27

In [39]:
#컬럼 순서 변경
fruits = pd.DataFrame(fruits,columns = ['Donut','Banana','Carrot','Apple'])
fruits

   Donut  Banana  Carrot  Apple
0      3       2       1      1
1      6       3       6      3
2      9       4       4      4
3     12       5       2      4
4     15       6       8      5
5     18       7       4      6
6     21       7       5      7
7     24       8       8      8
8     27       3       9      8

In [40]:
fruits*3

   Donut  Banana  Carrot  Apple
0      9       6       3      3
1     18       9      18      9
2     27      12      12     12
3     36      15       6     12
4     45      18      24     15
5     54      21      12     18
6     63      21      15     21
7     72      24      24     24
8     81       9      27     24